; Задача 0: Да се дефинира функция (solve-quadratic a b c), която връща като резултат решенията на квадратното уравнение ax^2 + bx + c = 0
; Задача 1: Да се дефинира функция (mid p1 p2), която намира средата на отсечката P1P2
; Задача 2: Да се дефинира функция (my-length l), която връща дължината на списъка l
; Задача 3: Да се дефинира функция (reverse l), която връща списъка, съдържащ елементите на l с обърната последователност
; Задача 4: Да се дефинира функция (my-map f l), която връща списък с елементи y = f(x) при x - елементи на l
; Задача 5: Да се дефинира функция (take-elem l n), която връща n-тия елемент на списъка l ((take-elem l 1) <=> (car l))
; Задача 6: Да се дефинира функция (quick-sort l), която имплементира алгоритъма quicksort
