#lang racket
; Задача 0: Дефинирайте функция (repeat i), която създава безкраен поток от елемента i

; Задача 1: Дефинирайте функция (stream-take s n), която взима първите n елемента на потока s
; Ако s е с дължина по-малка от n, да се върнат колкото елементи има

; Задача 2: Дефинирайте функция (stream-drop s n), която връща поток без първите n елемента на s
; Ако s е с дължина по-малка от n, да се върне празен списък

; Задача 3: Дефинирайте символ naturals-stream, който да съдържа
; безкраен поток от последователни естествени числа

; Задача 4: Дефинирайте функция (generate init f), която генерира
; безкрайния поток init, f(init), f(f(init) ...

; Задача 5: Дефинирайте функция (stream-map s f), която генерира поток от
; резултатите на функцията f приложена върху елементите на s

; Задача 6: Дефинирайте символ squares, който да съдържа
; безкраен поток от квадратите на всички естествени числа

; Задача 7: Дефинирайте функция (stream-filter s p), която генерира
; поток от елементите на s, за които (p x) връща истина

; Задача 8: Дефинирайте символ отговарящ на потока от естествени числа,
; които отговарят на условието (x^2 + 1) % 3 == 0

; Задача 9: Дефинирайте функция (to-stream l), която превръща списъка l в поток

; Задача 10: Дефинирайте функция (cycle l), която създава безкраен поток от непразния списък l
