; Не забравяйте за този ред
#lang racket

; Примитивни типове (константи)
; Символ
#\a
; Булева стойност
#t
#f
; Числа
5
-5
1/3
1+6i
; Символен низ
"asdf"

(equal? 0.5 1/2) ;#f
(= 0.5 1/2) ;#t
; на кратко:
; = работи само за числа и сравнява стоностите
; equal? може да го ползваме за други типове и е по-стриктно

; Функциите се прилагат в префиксна форма.
; (<name> <arg1> <arg2> ..)
; Винаги са оградени със скоби, като винаги първо е функцията.
; Всички елементи в списъка трябва да бъдат оценени до някаква стойност,
; за да се изчисли резултата.
(+ 1 2)
; + и * приемат произволен брой аргументи.
(* 1 2 3 4)

; По-слижни изрази - комбинации
(+ 2
   (/ 10 5)
   (* 1 2 3))

; Стила за идентация, който аз ще следвам е:
; - При разбиване на извикване на функция на няколко реда,
;   ще изнасям аргументите на нови редове - еднакво идентирани навътре
;   (по-навътре от самата функция)
; - горното правило се прилага за вложени извиквания
; - скобите се затварят зад последния аргумент от извикването

; Специална форма за дефиниция на символи (придаване на стойност).
(define x 2)
; Можем да свързваме символи и с функции.
(define plus +)
(plus 5 2)

; Можем да дефинираме и функции.
; (define
;   (<name> <arg1> <arg2> ..)
;   <body>)
(define (square x) (* x x))
; По конвенция функциите, връщащи булеви стойности се именуват с "?" в края.
(define (is-positive? x) (> x 0))

; if е специална форма и е израз.
; Можем да го свържем със символ.
; (if <cond> <then-value> <else-value>)
; Условието е #t ако не е #f
(define one-eq-two?
    (if (= 1 2)
      "Im the pope!"
      "Expected"))

; cond е друг условен израз и също е специална форма.
; Може и без else.
(define (abs x)
  (cond [(< x 0) (- x)]
        [(= x 0) 0]
        [else x]))

; булевите операции and и or са специални форми.
(define div (or #t (/ 2 0)))


;;;;;;;;;;
; ЗАДАЧИ ;
;;;;;;;;;;

; 1. За дадено естествено число n намира n+1.
(define (succ n) void)

; 2. За дадено естествено число n намира n-1.
(define (pred n) void)

; 3. За дадено число n, връща n/2 ако n е четно, и n в противен случай.
(define (safe-div n) void)

; 4. Намира номера на подаден месец от годината.
(define (month-index n) void)

; 5. За дадено x проверява дали е корен на (3*x^2 - 2*x - 1).
; Полинома не се променя.
; Корени: -1/3, 1
(define (is-root? n) void)

; 6. Намира n!.
(define (factorial n) void)

; 7. Намира n-тото число на Фибоначи.
(define (fib n) void)

; 8. Намира сумата на 2 естествени числа, използвайте succ и pred.
(define (add n) void)

; 9. намира произведението на 2 естествени числа.
; Използвайте sum и pred.
(define (multiply n) void)
