;
; СУ "Св. Климент Охридски"
; Факултет по математика и информатика
; Курс Функционално програмиране 2020/21
; Контролно 2
; 2020-12-12
;
; Име: 
; ФН:
; Специалност:
; Курс: 
; Административна група: 
; Начален час на контролното: <тук попълнете часа за вашата група>
;

#lang racket/base

(provide (all-defined-out)) ; Запазете този ред, за да може всички функции,
                            ; които сте написали, да се експортират и да може да се тестват.


; Това е примерна функция. Можете да напишете решението си на нейното място.
(define (sample-function x) x)

