{--
  СУ "Св. Климент Охридски"
  Факултет по математика и информатика
  Курс Функционално програмиране 2020/21
  Контролно 3
  2021-01-16

  Име:
  ФН:
  Специалност:
  Курс:
  Административна група:
  Начален час на контролното: <тук попълнете часа за вашата група>
--}

-- Променете името на модула и на файла така, че да съответстват на
-- факултетния ви номер. Например ако той е 12345, променете ги
-- съответно на K3_12345 и K3_12345.hs
-- (Можете да изтриете този коментар след като направите промените)
module K3 where

-- Това е примерна функция. Можете да напишете решението си на нейното място.
sample x = x
