#lang racket
; Задача 0: Да се дефинира функция (sum-divisors n a b), която връща като резултат сумата на числата в затворения интервал [a, b], които са делители на n
; Задача 0*: Да се дефинира функция (sum-squares a b), която връща като резултат сумата от квадратите на числата в затворения интервал [a, b]
; Задача 1: Да се дефинира функция (sum-mapped f a b), която връща като резултат сумата на резултата на изпълнението на функцията f върху числата в затворения интервал [a, b]
; Задача 2: Да се дефинира функция, която връща като резултат произведението на всички четни числа в интервала [a, b]
; Задача 3: Да се дефинира функция, която връща като резултат броя на всички точни квадрати в интервала [a, b]
; Задача 4: Да се дефинира функция, която проверява дали съществува число в интервала [a, b], за което функцията f да връща #t
; Задача 5: Да се дефинира функция (compose f g), която връща като резултат композицията на функциите f и g
; Задача 6: Да се дефинира функция (repeat f n), която връща като резултат функция, еквивалентна на прилагането на функцията f n-пъти
